AccumulationRegisters/ЛБ_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОсновное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОсновной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_КассоваяСменаСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КассоваяСменаСтатус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйДеньЗакрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийРеализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийРеализация</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияЛомбард</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЦОРозница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЦООпт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ЖурналПеремещенийОбъектовЗалога/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		Суперпользователь = Истина;
	КонецЕсли;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда 
			СотрудникЦО = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ СотрудникЦО Тогда
		Элементы.ДокументыДвиженияГруппаИзъятие.Видимость = ложь; 
		Элементы.ДокументыДвиженияГруппаВозвратИзъятого.Видимость = ложь;
		Элементы.ДокументыДвиженияИсторияЗалога.Видимость = Ложь;
	КонецЕсли;	

	ДатаКон = ТекущаяДатаСеанса();
	ДатаНач = ДатаКон;    
	ДатаНачТекущая = ДатаНач;
	ДатаКонТекущая = ДатаКон;
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	Если ТекПользователь.ЭтоЛомбард Тогда  
		Ломбард = ПараметрыСеанса.ТекущийЛомбард; 
		Элементы.Ломбард.Доступность = Ложь;
		//+МАН 19.03.26 Заявка 3750
		Элементы.Организация.Доступность = Ложь;
		//-МАН
		Элементы.ДобавитьПеремещение.Видимость = Ложь; 
		ОтбиратьПо = 0;
		Элементы.ОтбиратьПо.Доступность = Ложь;   
        Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Иначе      
		Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис; 
		Элементы.Ломбард.Доступность = Истина;
		//+МАН 19.03.26 Заявка 3750
		Элементы.Организация.Доступность = Истина;
		//-МАН
		Элементы.ДобавитьПеремещение.Видимость = Истина; 
        Элементы.ОтбиратьПо.Доступность = Истина; 
		Ответственный = ТекПользователь;
	КонецЕсли;	
	
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон))); 
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("ПустаяНакладная", Документы.ЛБ_НакладнаяНаОтгрузку.ПустаяСсылка());
	УстановитьОтбиратьПо();
	УстановитьОтборПоПодразделениямИСкладам();
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
	ОстаткиПоПеремещениям();                   
	ОбновитьИнформациюИтого();	
КонецПроцедуры     

&НаСервере 
Процедура  УстановитьОтборПоПодразделениямИСкладам() 
	Если ЗначениеЗаполнено(Ломбард) Тогда 
		ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделениям", Истина); 
		ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Подразделения", ПолучитьСписокПодразделений());
	Иначе  
		ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделениям", ложь);
		ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Подразделения", Новый СписокЗначений);
	КонецЕсли;	  
	Если ЗначениеЗаполнено(Склад) Тогда  
	    ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", Истина); 
		ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	Иначе  
	    ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", ложь);
		ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Склад", Справочники.ЛБ_Склады.ПустаяСсылка());
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов() 
	МассивСкладов = Новый Массив;
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос; 
		Запрос.УстановитьПараметр("Владелец", Ломбард);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец";
		Выборка = Запрос.Выполнить().Выбрать();     
		Пока Выборка.Следующий() Цикл 
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;	
	КонецЕсли;
	Возврат МассивСкладов;
КонецФункции

&НаСервере
Функция ПолучитьСписокПодразделений()  
	СписокПодразделений = Новый СписокЗначений;
	Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		СписокПодразделений.Добавить(Ломбард);
	ИначеЕсли ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ТекущаяДатаСеанса(), Ломбард);
	КонецЕсли;
	Возврат СписокПодразделений;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	УстановитьДоступностьПечати();
КонецПроцедуры

&НаСервере
Функция ПолучитьТипДокумента(Документ)
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда 
		Если Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Тогда
			Возврат 1;
		ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда	
		    Возврат 2;  
		ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда	
		    Возврат 3;  
	    ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда	
		    Возврат 4;  
        ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда	
		    Возврат 5;  
        ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога Тогда	
		    Возврат 6;  
        ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога Тогда	
		    Возврат 7;  
        ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления Тогда	
		    Возврат 8;  
		ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда	
		    Возврат 9; 
		ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ Тогда	
		    Возврат 9; 
		ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия Тогда	
		    Возврат 9; 
		ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого Тогда	
		    Возврат 9; 
		Иначе
			Возврат 0;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_НакладнаяНаОтгрузку") Тогда 
		Возврат 10;  
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") Тогда 
	     Возврат 11; 
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_ОприходованиеОбъектовЗалога") Тогда 
	     Возврат 12; 
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда 
	     Возврат 13; 	 	 
    Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ДокументыДвиженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  				
		ТипДокумента = ПолучитьТипДокумента(ТекСтрока.Регистратор);
		Если НЕ ТипДокумента = 0 Тогда
			Если ТипДокумента < 10 Тогда 
				ПараметрыФормы = Новый Структура;
	            ПараметрыФормы.Вставить("Документ", ТекСтрока.Регистратор);
				ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
				Если ТипДокумента = 1 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				ИначеЕсли ТипДокумента = 2 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
                ИначеЕсли ТипДокумента = 3 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
				ИначеЕсли ТипДокумента = 4 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	            ИначеЕсли ТипДокумента = 5 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
                ИначеЕсли ТипДокумента = 6 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
                ИначеЕсли ТипДокумента = 7 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаВыдачиЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
                ИначеЕсли ТипДокумента = 8 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
                ИначеЕсли ТипДокумента = 9 Тогда 
					ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаОперацииПоЗайму", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
              	КонецЕсли;	
			Иначе   
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Ключ", ТекСтрока.Регистратор);

				ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);     
				Если ТипДокумента = 10 Тогда  
					ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
                    ОткрытьФорму("Документ.ЛБ_НакладнаяНаОтгрузку.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);    
				ИначеЕсли ТипДокумента = 11 Тогда 
                    ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	            ИначеЕсли ТипДокумента = 12 Тогда 
                    ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
				ИначеЕсли ТипДокумента = 13 Тогда 
                    ОткрытьФорму("Документ.ЛБ_Реализация.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
                КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияОперации(Результат, ДопПараметры) Экспорт 
	Элементы.ДокументыДвижения.Обновить();
	ОстаткиПоПеремещениям();   
	ОбновитьИнформациюИтого();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)  
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда 
		Если ДатаНач > ДатаКон Тогда
			ДатаНач = ДатаНачТекущая;
			Предупреждение("Начальная дата выбранного периода не может быть больше конечной даты периода.", 60); 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	ДатаНачТекущая = ДатаНач;
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Дата1", НачалоДня(ДатаНач));	
	Элементы.ДокументыДвижения.Обновить(); 
	ОстаткиПоПеремещениям();
	ОбновитьИнформациюИтого();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)  
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда 
		Если ДатаКон < ДатаНач Тогда
			ДатаКон = ДатаКонТекущая;
			Предупреждение("Конечная дата выбранного периода не может быть меньше начальной даты периода.", 60); 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	ДатаКонТекущая = ДатаКон;
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ДатаКон, КонецДня(ДатаКон)));
 	Элементы.ДокументыДвижения.Обновить(); 
	ОстаткиПоПеремещениям();      
	ОбновитьИнформациюИтого(); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент) 
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 
	Элементы.ДокументыДвижения.Обновить();
	ОстаткиПоПеремещениям();       
	ОбновитьИнформациюИтого();
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	УстановитьОтборПоПодразделениямИСкладам();
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
	Элементы.ДокументыДвижения.Обновить();
	ОстаткиПоПеремещениям();  
	ОбновитьИнформациюИтого();
КонецПроцедуры 

&НаКлиенте
Процедура ЛомбардОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборПоПодразделениямИСкладам();
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
	Элементы.ДокументыДвижения.Обновить();
	ОстаткиПоПеремещениям();  
	ОбновитьИнформациюИтого();
КонецПроцедуры

&НаСервере
Функция ПроверитьКассовыйДеньЗакрыт(Документ = неопределено) 
	СтруктураВозврата = Новый Структура;
	Если Документ = неопределено Тогда
		ДатаПроверки = ?(СотрудникЦО ИЛИ Суперпользователь, ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)), ТекущаяДатаСеанса());
	Иначе
		ДатаПроверки = КонецДня(Документ.Дата);
	КонецЕсли;	  
	Результат = ЛБ_ОбщийМодуль.ПолучитьЗакрытыйКассовыйДень(ДатаПроверки, Организация, Ломбард); 
	Если НЕ Результат = неопределено Тогда  
		Если Результат.КассовыйДень = НачалоДня(ДатаКон) Тогда        		
			СтруктураВозврата.Вставить("Результат", Истина);
			СтруктураВозврата.Вставить("Сообщение", "Кассовый день " + Формат(ДатаПроверки, "ДФ=dd.MM.yyyy") + " закрыт.");
			Возврат СтруктураВозврата;    
  		КонецЕсли;
	КонецЕсли;	

	СтруктураКС = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(ДатаПроверки, Организация, Ломбард); 
	Если СтруктураКС = неопределено Тогда 
		СтруктураВозврата.Вставить("Результат", Истина);
		СтруктураВозврата.Вставить("Сообщение", "Кассовая смена не открыта.");
		Возврат СтруктураВозврата;
	ИначеЕсли СтруктураКС.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Закрыта Тогда
			СтруктураВозврата.Вставить("Результат", Истина);
			СтруктураВозврата.Вставить("Сообщение", "Кассовая смена закрыта.");
			Возврат СтруктураВозврата;       
	КонецЕсли;	
	СтруктураВозврата.Вставить("Результат", Ложь);
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере 
Функция ПолучитьДатуСеанса() 
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ДобавитьПеремещение(Команда) 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьПоступление(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ДействиеЗапретить(Регистратор, Код) 
	Если НЕ НачалоДня(Регистратор.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		Если Код = 1 Тогда //проведение   
			Если НЕ Регистратор.Проведен Тогда
				Возврат Истина;  
		    КонецЕсли;	
	    ИначеЕсли Код = 2 Тогда //отмена проведения 
		    Если Регистратор.Проведен Тогда
			    Возврат Истина;  
			КонецЕсли;	
		ИначеЕсли Код = 3 Тогда //удаление
			Если Регистратор.Проведен Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;    
КонецФункции

&НаСервере
Функция УдалитьНаСервере(Документ)  
	СтруктураВ = новый структура;
	ДокОбъект = Документ.ПолучитьОбъект();  
	Пометка = ?(ДокОбъект.ПометкаУдаления, Ложь, Истина);
	ДокОбъект.УстановитьПометкуУдаления(Пометка);  
	СтруктураВ.Вставить("Результат", Истина);   
	Возврат СтруктураВ;
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
    ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		КодРегистратора = ПолучитьТипДокумента(ТекСтрока.Регистратор);
		Если КодРегистратора >= 11 Тогда   
			Если КодРегистратора = 13 Тогда 
				Если НЕ Суперпользователь Тогда
					Если ДействиеЗапретить(ТекСтрока.Регистратор, 3) Тогда
						Предупреждение("Пометка на удаление этого документа пользователю запрещена.", 60);
						Возврат;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			СтруктураВ = УдалитьНаСервере(ТекСтрока.Регистратор);
			Если СтруктураВ.Результат Тогда
				Элементы.ДокументыДвижения.Обновить();   
				ОстаткиПоПеремещениям();
				ОбновитьИнформациюИтого();
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60);
			КонецЕсли;
		Иначе
			Предупреждение("Пометка на удаление этого документа из журнала запрещена.", 60);	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПровестиНаСервере(Документ) 
	СтруктураВ = новый структура;  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.ПометкаУдаления Тогда
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Помеченный на удаление документ не может быть проведен!"); 
		Возврат СтруктураВ;
	КонецЕсли;	 
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		СтруктураВ.Вставить("Результат", Истина); 
		Возврат СтруктураВ;
	Исключение  
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Ошибка проведения, документ не проведен!"); 
		Возврат СтруктураВ;
	КонецПопытки	
КонецФункции

&НаКлиенте
Процедура Провести(Команда)    
	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		КодРегистратора = ПолучитьТипДокумента(ТекСтрока.Регистратор);
		Если КодРегистратора >= 11 Тогда   
			Если КодРегистратора = 13 Тогда 
				Если НЕ Суперпользователь Тогда
					Если ДействиеЗапретить(ТекСтрока.Регистратор, 1) Тогда
						Предупреждение("Проведение этого документа пользователю запрещена.", 60);
						Возврат;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			СтруктураВ = ПровестиНаСервере(ТекСтрока.Регистратор);
			Если СтруктураВ.Результат Тогда
				Элементы.ДокументыДвижения.Обновить();   
				ОстаткиПоПеремещениям();
				ОбновитьИнформациюИтого();
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60);
			КонецЕсли;    
		Иначе
			Предупреждение("Проведение этого документа из журнала запрещено.", 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры      

&НаСервере
Функция ОтменитьПроведениеНаСервере(Документ)
	ДокОбъект = Документ.ПолучитьОбъект(); 
	СтруктураВ = новый структура;  
		
	Если НЕ ДокОбъект.Проведен Тогда
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Выбранный документ не проведен!"); 
		Возврат СтруктураВ;
	КонецЕсли;	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
		СтруктураВ.Вставить("Результат", Истина);
		Возврат СтруктураВ;
	Исключение  
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Ошибка отмены проведения документа!"); 
		Возврат СтруктураВ;
	КонецПопытки	
КонецФункции

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
 	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		КодРегистратора = ПолучитьТипДокумента(ТекСтрока.Регистратор);
		Если КодРегистратора >= 11 Тогда   
			Если КодРегистратора = 13 Тогда 
				Если НЕ Суперпользователь Тогда
					Если ДействиеЗапретить(ТекСтрока.Регистратор, 2) Тогда
						Предупреждение("Отмена проведения этого документа пользователю запрещена.", 60);
						Возврат;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			СтруктураВ = ОтменитьПроведениеНаСервере(ТекСтрока.Регистратор);
			Если СтруктураВ.Результат Тогда
				Элементы.ДокументыДвижения.Обновить();   
				ОстаткиПоПеремещениям();
				ОбновитьИнформациюИтого();
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60);
			КонецЕсли;	
	    Иначе
			Предупреждение("Отмена проведения этого документа из журнала запрещена.", 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРеализацияИзделия(Команда) 
	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
        Если НЕ ТекСтрока.СостояниеДокумента = 1 Тогда  
			Предупреждение("Печать непроведенного документа запрещена!", 60);
			Возврат;
		КонецЕсли;				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "Реализация"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Реализация");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.Регистратор);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
   КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьРеализацияЛом(Команда) 
	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
        Если НЕ ТекСтрока.СостояниеДокумента = 1 Тогда  
			Предупреждение("Печать непроведенного документа запрещена!", 60);
			Возврат;
		КонецЕсли;				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "РеализацияЛом"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Реализация");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.Регистратор);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРеализацияЧек(Команда) 
	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
        Если НЕ ТекСтрока.СостояниеДокумента = 1 Тогда  
			Предупреждение("Печать непроведенного документа запрещена!", 60);
			Возврат;
		КонецЕсли;				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "КассовыйЧек"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Реализация");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.Регистратор);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
   КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОстатокНаДатуОперации(Дата) 
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ДенежныеСредстваОстатки.СуммаОстаток) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДенежныеСредства.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)) КАК ЛБ_ДенежныеСредстваОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард"; 
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.Сумма;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура ОбновитьИнформациюОстатокОперации()
	//ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные;
	//Если НЕ ТекСтрока = неопределено Тогда
	//	Остаток = ОстатокНаДатуОперации(ТекСтрока.Дата);  
	//	Если ТекСтрока.СостояниеДокумента = 1 Тогда 
	//	    Остаток = Остаток + ТекСтрока.Приход - Текстрока.Расход;  
	//	КонецЕсли;
	//	Элементы.ДекорацияОперацияОстаток.Заголовок = Формат(Остаток, "ЧЦ=15; ЧДЦ=2; ЧФ=' Ч  ""руб. ""'");  
	//	Если Остаток < 0 Тогда 
	//		Элементы.ДекорацияОперацияОстаток.ЦветТекста = WebЦвета.Красный;
	//	Иначе 
	//		Элементы.ДекорацияОперацияОстаток.ЦветТекста = WebЦвета.Зеленый;
	//	КонецЕсли;	
	//Иначе 
	//	Элементы.ДекорацияОперацияОстаток.Заголовок = "";
	//КонецЕсли;	
КонецПроцедуры	   

&НаСервере
Процедура УстановитьДоступностьПечатиНаСервере(Регистратор)
	Если НЕ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда
		Элементы.ДокументыДвиженияПечатьРеализацияИзделия.Видимость = Ложь;
		Элементы.ДокументыДвиженияПечатьРеализацияЛом.Видимость = Ложь;
		Элементы.ДокументыДвиженияПечатьРеализацияКассовыйЧек.Видимость = Ложь;
	ИначеЕсли Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт Тогда 
		Элементы.ДокументыДвиженияПечатьРеализацияИзделия.Видимость = Истина;
		Элементы.ДокументыДвиженияПечатьРеализацияЛом.Видимость = Истина;
		Элементы.ДокументыДвиженияПечатьРеализацияКассовыйЧек.Видимость = Ложь;
	Иначе	                                                                     
		Элементы.ДокументыДвиженияПечатьРеализацияИзделия.Видимость = Ложь;
		Элементы.ДокументыДвиженияПечатьРеализацияЛом.Видимость = Ложь;
		Элементы.ДокументыДвиженияПечатьРеализацияКассовыйЧек.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПечати()
	ТекСтрока = Элементы.ДокументыДвижения.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
	    УстановитьДоступностьПечатиНаСервере(ТекСтрока.Регистратор); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КассовыеОперацииПриАктивизацииСтроки(Элемент)
	ОбновитьИнформациюОстатокОперации();
	УстановитьДоступностьПечати();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(ДатаНач, ДатаКон);
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ДатаНач = Период.ДатаНачала;
    ДатаКон = Период.ДатаОкончания;
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда
		Если  ДатаКон < ДатаНач Тогда 
			ДатаНач = ДатаНачТекущая;
	        ДатаКон = ДатаКонТекущая;
			Предупреждение("Конечная дата выбранного периода не может быть меньше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	ДатаНачТекущая = ДатаНач;
	ДатаКонТекущая = ДатаКон;
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	ДокументыДвижения.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ДатаКон, КонецДня(ДатаКон)));	
	Элементы.ДокументыДвижения.Обновить(); 
	ОстаткиПоПеремещениям(); 
	ОбновитьИнформациюИтого();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.ДокументыДвижения.Обновить(); 
	ОстаткиПоПеремещениям();
	ОбновитьИнформациюИтого();
КонецПроцедуры


&НаСервере
Функция ПроверитьПроведен(Документ) 
	Возврат ?(Документ.Проведен, Истина, Ложь);
КонецФункции		

&НаСервере
Функция ПроверитьМожноОтменить(Документ) 
	Если Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков") ИЛИ
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО") ИЛИ 
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентов") ИЛИ 
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке") ИЛИ
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога") ИЛИ 
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО") Тогда   
		Возврат Истина; 
	КонецЕсли;	
    Возврат Ложь;
КонецФункции		

&НаСервере
Процедура УстановитьОтбиратьПо()
	Если ОтбиратьПо = 0 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_Ломбарды";
	    Элементы.Ломбард.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);		
		Элементы.Склад.ТолькоПросмотр = Ложь;   
		Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		КонецЕсли;	
	ИначеЕсли ОтбиратьПо = 1 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_ОтделенияЛомбардов";
	    Элементы.Ломбард.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр); 
		Элементы.Склад.ТолькоПросмотр = Истина; 
		Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			Ломбард = Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;	
	Значение = Элементы.Ломбард;
    Элементы.Ломбард.ОграничениеТипа.ПривестиЗначение(Значение);
    Элементы.Ломбард.ВыбиратьТип = Ложь;  	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоПриИзменении(Элемент)  
	УстановитьОтбиратьПо();               
	Склад = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка"); 
	Элементы.Склад.СписокВыбора.Очистить();
	УстановитьОтборПоПодразделениямИСкладам();  
	Элементы.ДокументыДвижения.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	УстановитьОтборПоПодразделениямИСкладам();  
	Элементы.ДокументыДвижения.Обновить();
	ОстаткиПоПеремещениям();  
	ОбновитьИнформациюИтого();
КонецПроцедуры   

&НаКлиенте
Процедура СкладОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборПоПодразделениямИСкладам();  
	Элементы.ДокументыДвижения.Обновить();
	ОстаткиПоПеремещениям();  
	ОбновитьИнформациюИтого();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюИтого()    
	Дата1 = ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач));
	Дата2 = ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон));
	
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", Дата1); 
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК Кол
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам КАК ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам
	               |ГДЕ
	               |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период МЕЖДУ &Дата1 И &Дата2";
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Запрос.УстановитьПараметр("Подразделения", ПолучитьСписокПодразделений());
		Запрос.Текст = Запрос.Текст + "
	               |	И (ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеОтправитель В (&Подразделения)
	               |			ИЛИ ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеПолучатель В (&Подразделения))";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.УстановитьПараметр("Склад", Склад);
        Запрос.Текст = Запрос.Текст + "
	               |	И (ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладОтправитель = &Склад
	               |			ИЛИ ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладПолучатель = &Склад)";  
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
        ИтогоОпераций = Выборка.Кол; 
	Иначе 
		ИтогоОпераций = 0;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОстаткиПоПеремещениям()  
		
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));  
	Запрос.УстановитьПараметр("Дата2", ?(ДатаКон = Дата(1,1,1), ДатаКон, КонецДня(ДатаКон)));
	Запрос.УстановитьПараметр("Организация", Организация);  
	Условие = "";
	Если ЗначениеЗаполнено(Ломбард) Тогда  
		Запрос.УстановитьПараметр("Подразделения", ПолучитьСписокПодразделений());
        Условие = Условие + " И Ломбард В (&Подразделения)";
	КонецЕсли;	  
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.УстановитьПараметр("Склад", Склад);
        Условие = Условие + " И Склад = &Склад";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНач,
	               |	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКон, 
				   |	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
				    |	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			,
	               |			,
	               |			Организация = &Организация"  + Условие + ") КАК ЛБ_ОбъектыЗалогаОстаткиИОбороты";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ОстатокНач = Выборка.КоличествоНач;
		ОстатокКон = Выборка.КоличествоКон;
		Приход = Выборка.КоличествоПриход; 
		Расход = Выборка.КоличествоРасход;
	Иначе
		ОстатокНач = 0;
		ОстатокКон = 0; 
	КонецЕсли;	 
	                    
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалога.ВидДвижения КАК ВидДвижения,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ОбъектыЗалога.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоОперацияЗайма,
	               |	СУММА(ЛБ_ОбъектыЗалога.Количество) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалога.Период МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_ОбъектыЗалога.Организация = &Организация" + Условие + "
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалога.ВидДвижения,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ОбъектыЗалога.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход); 
	Отбор.Вставить("ЭтоОперацияЗайма", Истина); 
	
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если строки.Количество() = 0 тогда
		ПриходОперации = 0;
	Иначе
		ПриходОперации = Строки.Получить(0).Количество;
	КонецЕсли;	   
	
	Отбор.Вставить("ЭтоОперацияЗайма", Ложь); 
	
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если строки.Количество() = 0 тогда
		ПриходПеремещения = 0;
	Иначе
		ПриходПеремещения = Строки.Получить(0).Количество;
	КонецЕсли;	
		
	Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход); 
	Отбор.Вставить("ЭтоОперацияЗайма", Истина); 
	
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если строки.Количество() = 0 тогда
		РасходОперации = 0;
	Иначе
		РасходОперации = Строки.Получить(0).Количество;
	КонецЕсли;	   
	
	Отбор.Вставить("ЭтоОперацияЗайма", Ложь); 
	
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если строки.Количество() = 0 тогда
		РасходПеремещения = 0;
	Иначе
		РасходПеремещения = Строки.Получить(0).Количество;
	КонецЕсли;	
		
	//ТекстРасшифровки = "Приход изделий по операциям займа " + Строка(ПриходОперации) + " шт., по остальным операциям " + Строка(ПриходПеремещения) + " шт. " +  
	//     "Расход изделий по операциям займа " + Строка(РасходОперации) + " шт., по остальным операциям " + Строка(РасходПеремещения) + " шт. ";
	
	ТекстРасшифровки = "По операциям займа приход изделий " + Строка(ПриходОперации) + " шт., расход изделий " + Строка(РасходОперации) + " шт. " +
	     "По остальным операциям приход изделий " + Строка(ПриходПеремещения) + " шт., расход изделий " + Строка(РасходПеремещения) + " шт. ";
    Элементы.РасшифровкаОборотаПеремещений.Заголовок = ТекстРасшифровки;
КонецПроцедуры	

&НаКлиенте
Процедура Реализация(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_Реализация.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//lion+++ 18.08.25
&НаСервереБезКонтекста
Процедура ДокументыДвиженияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого строкастроки из строки цикл
		Если строкастроки.Значение.Данные.Регистратор.ВидОперации=Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт 
			 или строкастроки.Значение.Данные.Регистратор.ВидОперации=Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница
			 или строкастроки.Значение.Данные.Регистратор.ВидОперации=Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард
			тогда
				строкастроки.Значение.Данные.ВидОперации=строкастроки.Значение.Данные.Регистратор.ВидОперации;
		КонецЕсли;
	конеццикла;
КонецПроцедуры
//lion--- 18.08.25 

&НаКлиенте
Процедура Изъятие(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога")); 
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИзъятие", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзъятие(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗалоговыйБилет);
		ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
								
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьПередОтменойИзъятия()
	ТекДата = ТекущаяДатаСеанса();
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекДата));  
	Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ЦентральныйОфис);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ДокументЗалога,
	               |	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК Номер
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога)
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.Ломбард = &Ломбард"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ОтменаИзъятия(Команда)
	Если НЕ ПроверитьПередОтменойИзъятия() Тогда
		Предупреждение("Не найдены документы изъятия из ЦО для которых возможна операция отмены.", 60);    
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты")); 
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтменаОперацииПоЗайму", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтменаОперацииПоЗайму(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ОтменяемаяОперация = ПолучитьИнформациюОЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата()); 
		//+МАН Изменил т.к. не тем сравнивается.
		//Если НЕ ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда
		Если НЕ ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда
		//-МАН
			//+МАН 13.03.26 Изменил сообщение. Заявка 3654.
			//Предупреждение("Вид последней операции с ЗБ " + СокрЛП(Результат.НомерЗалоговогоБилета) + " не изъятие объектов залога. Отмена изъятия не возможна!");  
			Предупреждение("Отмена изъятого по ЗБ №" + СокрЛП(Результат.НомерЗалоговогоБилета) + " невозможна, т.к. операция уже была отменена.");  
			//-МАН
			Возврат;
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);

		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,, ОбработкаВыбора);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(НомерЗалоговогоБилета, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, Дата, Истина);
	
	ИнформацияОЗБ = Новый Структура;
	ИнформацияОЗБ.Вставить("Документ", Результат.Регистратор);
	ИнформацияОЗБ.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	
	Возврат ИнформацияОЗБ;
	
КонецФункции

&НаКлиенте
Процедура ВозвратИзъятого(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога"));
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВозвратаИзъятие", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВозвратаИзъятие(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗалоговыйБилет);
		ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
								
		ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьПередОтменойВозвратаИзъятия()
	ТекДата = ТекущаяДатаСеанса();
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекДата));  
	Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ЦентральныйОфис);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ДокументЗалога,
	               |	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК Номер
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога)
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.Ломбард = &Ломбард"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ОтменаВозвратаИзъятого(Команда)
	Если НЕ ПроверитьПередОтменойВозвратаИзъятия() Тогда
		Предупреждение("Не найдены документы возврата изъятого в ЦО для которых возможна операция отмены.", 60);    
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты")); 
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтменаОперацииПоЗаймуВозврат", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтменаОперацииПоЗаймуВозврат(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ОтменяемаяОперация = ПолучитьИнформациюОЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());
		Если НЕ ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда
			//+МАН 13.03.26 Изменил сообщение. Заявка 3654.
			//Предупреждение("Вид последней операции с ЗБ " + СокрЛП(Результат.НомерЗалоговогоБилета) + " не возврат изъятых объектов залога. Отмена возврата изъятого не возможна!");  
			Предупреждение("Отмена возврата изъятого по ЗБ №" + СокрЛП(Результат.НомерЗалоговогоБилета) + " невозможна, т.к. операция уже была отменена.");  
			//-МАН
			Возврат;
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);

		ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,, ОбработкаВыбора);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюЗалогаПоАртикулу(Артикул)
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, Артикул = &Артикул) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СтруктураВ = Новый структура;
		СтруктураВ.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
		СтруктураВ.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		Возврат СтруктураВ;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

&НаКлиенте
Процедура ИсторияЗалога(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалога", ЭтаФорма);
  	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаЗапускаИсторииДвиженияЗалога", , ЭтаФорма, Истина,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
 КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораЗалога(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗалоговыйБилет);
	ПараметрыФормы.Вставить("ОбъектЗалога", Результат.ОбъектЗалога);	
									
	ОткрытьФорму("Отчет.ЛБ_ИсторияДвиженияОбъектаЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры
